Depth_10L/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pimpleFoam;

startFrom       latestTime;

stopAt          endTime;

endTime         0.025;

deltaT          1.0e-5;

// writeControl    timeStep;
writeControl    runTime;

// writeInterval  	10;
writeInterval  	1e-4;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  yes;

//maxCo           0.05;
maxCo           2.0;

functions
{
    //#includeFunc "stressComponents"
   // #includeFunc "pressureCoefficient"
   // #includeFunc "sample"
   // #includeFunc "sampleCp"
   // #includeFunc "writeCellCentres"
   // #includeFunc "wallShearStress"
}

// ************************************************************************* //

