Depth_10L/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    // p
    // {
    //     solver          GAMG;
    //     tolerance       1e-6;
    //     relTol          0.1;
    //     smoother        GaussSeidel;
    // }
    
    p
    {
        solver          PCG; 
        preconditioner  DIC; 
        tolerance       1e-05;
       maxIter       1000;  // defaults to 1000, set to whatever you want 
        relTol          0.05; 
    }

    "(U|k|epsilon|nuTilda|omega)"
    {
        solver          smoothSolver;
	    //preconditioner  DILU;
        smoother        symGaussSeidel;
        tolerance       1e-05;
        relTol          0.1;
    }

    pFinal
    {
        $p;
        smoother        DICGaussSeidel;
        tolerance       1e-06;
        relTol          0;
    }

    "(U|k|nuTilda)Final"
    {
        $U;
        tolerance       1e-05;
        relTol          0;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 0;
    consistent      yes;

    residualControl
    {
        p               1e-3;
        U               1e-6;

//        "(k|nuTilda|epsilon|omega|f|v2)" 1e-5;
    }
}

relaxationFactors
{
    fields
    {
	p 	0.9;		
    }	

    equations
    {
        U               0.9; //0.9
        nuTilda		0.9;
	
	//".*"            0.5; //0.7
    }
}

PIMPLE
{
    nOuterCorrectors 1;
    nCorrectors     2;
    //nCorrectors     5;
    nNonOrthogonalCorrectors 0;
    //nNonOrthogonalCorrectors 2;
    pRefCell        1001;
    pRefValue       0;
}



// ************************************************************************* //

