Depth_10L/system/probes1



type probes;

libs ("libsampling.so");

writeControl timeStep;
writeInterval 1; 
fields 
    (
        U
    ); 

probeLocations
    (
        (0.004 0.013 0.0) 
        (0.004 0.013 0.01) 
        (0.004 0.013 0.02) 
        (0.004 0.013 0.03) 
        (0.004 0.013 0.04) 
        (0.004 0.013 0.05) 
        (0.004 0.013 0.06) 
        (0.004 0.013 0.07) 
        (0.004 0.013 0.08) 
        (0.004 0.013 0.09) 
        // (0.004 0.07 0.0) 
        // (0.04 0.07 0.0)
        // (0.1 0.07 0.0)
    );
